import { bugsBuilding } from "./bugsBuilding";

describe("BugsBuilding function test:", () => {
  let array, emptyArray;

  beforeEach(() => {
    array = [
      {
        ID: 102,
        System: "System2",
        Summary: "just text",
        Состояние: "Закрыт",
        "Найдено при": "SystemTest",
        Критичность: "Низкий",
        "Тип Дефекта": "ПО",
        "Дата создания": "2015-03-17 00:00:00.0000000",
        "Дата изменения": "2017-01-12 19:56:14.0000000",
        "Дата закрытия": "2015-04-22 00:00:00.0000000",
        "Метод обнаружения": "Не назначен",
        reopens_amount: null,
      },
      {
        ID: 103,
        System: "System2",
        Summary: "just text",
        Состояние: "Закрыт",
        "Найдено при": "SystemTest",
        Критичность: "Низкий",
        "Тип Дефекта": "ПО",
        "Дата создания": "2015-03-18 00:00:00.0000000",
        "Дата изменения": "2016-03-25 16:32:31.0000000",
        "Дата закрытия": "2016-03-25 00:00:00.0000000",
        "Метод обнаружения": "Не назначен",
        reopens_amount: null,
      },
    ];
    emptyArray = [];
  });

  test("should return correct data", () => {
    const results = {
      data: {
        monthArray: ["Март 2015"],
        monthArrayWithIndex: ["0_Март 2015"],
        arrayForGraphRead: [
          {
            name: "Март 2015",
            "Количество зарегистрированных дефектов": 2,
            bugs: [
              {
                ID: 102,
                System: "System2",
                Summary: "just text",
                Состояние: "Закрыт",
                "Найдено при": "SystemTest",
                Критичность: "Низкий",
                "Тип Дефекта": "ПО",
                "Дата создания": "2015-03-17 00:00:00.0000000",
                "Дата изменения": "2017-01-12 19:56:14.0000000",
                "Дата закрытия": "2015-04-22 00:00:00.0000000",
                "Метод обнаружения": "Не назначен",
                reopens_amount: null,
              },
              {
                ID: 103,
                System: "System2",
                Summary: "just text",
                Состояние: "Закрыт",
                "Найдено при": "SystemTest",
                Критичность: "Низкий",
                "Тип Дефекта": "ПО",
                "Дата создания": "2015-03-18 00:00:00.0000000",
                "Дата изменения": "2016-03-25 16:32:31.0000000",
                "Дата закрытия": "2016-03-25 00:00:00.0000000",
                "Метод обнаружения": "Не назначен",
                reopens_amount: null,
              },
            ],
          },
        ],
        arrayForGraphRender: [
          {
            name: "Март 2015",
            "Количество зарегистрированных дефектов": 2,
            bugs: [
              {
                ID: 102,
                System: "System2",
                Summary: "just text",
                Состояние: "Закрыт",
                "Найдено при": "SystemTest",
                Критичность: "Низкий",
                "Тип Дефекта": "ПО",
                "Дата создания": "2015-03-17 00:00:00.0000000",
                "Дата изменения": "2017-01-12 19:56:14.0000000",
                "Дата закрытия": "2015-04-22 00:00:00.0000000",
                "Метод обнаружения": "Не назначен",
                reopens_amount: null,
              },
              {
                ID: 103,
                System: "System2",
                Summary: "just text",
                Состояние: "Закрыт",
                "Найдено при": "SystemTest",
                Критичность: "Низкий",
                "Тип Дефекта": "ПО",
                "Дата создания": "2015-03-18 00:00:00.0000000",
                "Дата изменения": "2016-03-25 16:32:31.0000000",
                "Дата закрытия": "2016-03-25 00:00:00.0000000",
                "Метод обнаружения": "Не назначен",
                reopens_amount: null,
              },
            ],
          },
        ],
        systemTypes: ["System2"],
        criticalTypes: ["Низкий"],
        monthFrom: "Март 2015",
        monthTo: "Март 2015",
        keysBugs: [
          "ID",
          "System",
          "Summary",
          "Состояние",
          "Найдено при",
          "Критичность",
          "Тип Дефекта",
          "Дата создания",
          "Дата изменения",
          "Дата закрытия",
          "Метод обнаружения",
          "reopens_amount",
        ],
      },
      intervalObj: {
        "0_Март 2015": {
          name: "Март 2015",
          length: 2,
          bugs: [
            {
              ID: 102,
              System: "System2",
              Summary: "just text",
              Состояние: "Закрыт",
              "Найдено при": "SystemTest",
              Критичность: "Низкий",
              "Тип Дефекта": "ПО",
              "Дата создания": "2015-03-17 00:00:00.0000000",
              "Дата изменения": "2017-01-12 19:56:14.0000000",
              "Дата закрытия": "2015-04-22 00:00:00.0000000",
              "Метод обнаружения": "Не назначен",
              reopens_amount: null,
            },
            {
              ID: 103,
              System: "System2",
              Summary: "just text",
              Состояние: "Закрыт",
              "Найдено при": "SystemTest",
              Критичность: "Низкий",
              "Тип Дефекта": "ПО",
              "Дата создания": "2015-03-18 00:00:00.0000000",
              "Дата изменения": "2016-03-25 16:32:31.0000000",
              "Дата закрытия": "2016-03-25 00:00:00.0000000",
              "Метод обнаружения": "Не назначен",
              reopens_amount: null,
            },
          ],
        },
      },
    };
    const resultOfEmptyArray = {
      data: {
        monthArray: [],
        monthArrayWithIndex: [],
        arrayForGraphRead: [],
        arrayForGraphRender: [],
        systemTypes: [],
        criticalTypes: [],
        keysBugs: 0,
      },
      intervalObj: {},
    };

    expect(bugsBuilding(array)).toEqual(results);
    expect(bugsBuilding(emptyArray)).toEqual(resultOfEmptyArray);
  });
});
